articles/_posts/2013-08-22-Gaming-with-a-thin-client-on-GNU-Linux-at-native-FPS.html
(setf
title     "Gaming with a thin client on GNU/Linux at native FPS"
date      "<2013-08-22 Thu>"
meta-keys "Gaming, GNU/Linux, VNC, Thin client"
meta-desc "Gaming with a thin client on GNU/Linux at native FPS speeds"
author    "Matthew Carter")
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Preface</a></li>
<li><a href="#sec-2">Get native FPS speeds over your LAN from your thin client to your desktop</a></li>
<li><a href="#sec-3">Required packages</a></li>
<li><a href="#sec-4">Step one: Installing your packages</a></li>
<li><a href="#sec-5">Step two: Creating the reverse VNC listener</a></li>
<li><a href="#sec-6">Step three: Connecting to the listener</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Preface</h2>
<div class="outline-text-2" id="text-1">

<p>I wasn't entirely sure it was possible (lots of issues attempting to get
it working over VNC - I made some attempts at TurboVNC/TigerVNC/TightVNC
and VirtualGL, however the easiest way to:
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Get native FPS speeds over your LAN from your thin client to your desktop</h2>
<div class="outline-text-2" id="text-2">

<p>was to simply run reverse VNC and launch the game on the native GNU/Linux
desktop display (:0.0).
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Required packages</h2>
<div class="outline-text-2" id="text-3">

<p>The following packages are required to make this work:
</p><ul>
<li>x11vnc (on the desktop/host machine)
</li>
<li>vncviewer (on the thin client/laptop - I like the implementation in TigerVNC)
</li>
<li>A game to play
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Step one: Installing your packages</h2>
<div class="outline-text-2" id="text-4">

<p>Use your package manager to install the necessary packages on the necessary machines.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Step two: Creating the reverse VNC listener</h2>
<div class="outline-text-2" id="text-5">

<p>On the thin client / laptop, being a reverse VNC connection via the following:
</p>



<pre class="src src-sh">vncviewer -listen
</pre>


<p>
This will cause your VNC application to sit and wait for a connection -
unlike a typical vncserver, the connection will not view your thin client, but will
push it's display outward to you.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Step three: Connecting to the listener</h2>
<div class="outline-text-2" id="text-6">

<p>Assume your thin client is on ip 192.168.0.4
Your fat client/desktop is on ip 192.168.0.5
</p>
<p>
From your thin client, perform the following commands (note your IP address):
</p>



<pre class="src src-sh">ssh 192.168.0.5
</pre>


<p>
At this point, you are now ssh'ed into your desktop, run the following:
</p>



<pre class="src src-sh"><span style="color: #0000ff; font-weight: bold;">export</span> <span style="color: #ffff00;">DISPLAY</span>=<span style="color: #00ff00;">":0.0"</span>
x11vnc -connect 192.168.0.4
</pre>


<p>
You will now see your thin client pop open a VNC window showing your
native desktop display.
</p>
<p>
At this point, you can open a terminal in the VNC display and run
whatever game your heart desires.
</p></div>
</div>
